tap "caskroom/cask"
tap "caskroom/fonts"
tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"

??? iterm settings
??? vs code settings
??? dank mono

brew "burntsushi/ripgrep/ripgrep-bin"
brew "git"
brew "nvm"
brew "wget" 
brew "jenv"
brew "autojump" 
brew "exa"
brew "bat"
brew "fd"
brew "fzf"
brew "m-cli"
brew "the_silver_searcher"
brew "tldr"
brew "transcrypt"
brew "fx"
brew "yq"
brew "aria2"
brew "httpie"                               

cask "font-fira-code"
cask "logitech-presentation"
cask "iterm2"                               
cask "docker"                               
cask "adoptopenjdk"                         
cask "vlc"                                  
cask "google-chrome"                          
cask "firefox"
cask "1password"
cask "alfred"
cask "imageoptim"                           
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "paste"
cask "spectacle"
cask "telegram"
cask "visual-studio-code"

mas "Xcode", id: 497799835
mas "Sip", id: 507257563
mas "Noizio", id: 928871589
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Todoist", id: 585829637