tap "caskroom/cask"
tap "caskroom/fonts"
tap "dflemstr/tools"

# well... it's Git
brew "git"

# node version manager
brew "n"

# people ask you for the Wi-Fi password. Answer quickly.
brew "wifi-password"

brew "dbngin"

brew "wget"
brew "autojump"
brew "exa"
brew "bat"
brew "m-cli"
brew "fd"
brew "fzf"
brew "aria2"
brew "m-cli"
brew "mkcert"
brew "tldr"
brew "transcrypt"
brew "jq"
brew "yq"
brew "httpie"

cask "rq"
cask "docker"
cask "iina"

# sloth is a native Mac app that shows all open files and sockets in use by all running processes on your system
cask "sloth"
cask "typeit4me"
cask "google-chrome"
cask "chromedriver"
cask "1password"
cask "alfred"
cask "contexts"
cask "bartender"
cask "imageoptim"
cask "intellij-idea-ce"
cask "paste"
cask "spectacle"
cask "telegram"
cask "visual-studio-code"
cask "grammarly"
cask "slack"
cask "stats"
cask "spotify"
cask "freedom"

mas "DigiDoc4 Client", id: 1370791134
mas "Xcode", id: 497799835
mas "Sip", id: 507257563
mas "Noizio", id: 928871589
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
