tap "caskroom/cask"
tap "caskroom/fonts"
tap "dflemstr/tools"
tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"

# ripgrep recursively searches directories for a regex pattern
brew "burntsushi/ripgrep/ripgrep-bin"

# well... it's Git
brew "git"

# node version manager
brew "nvm"

# people ask you for the Wi-Fi password. Answer quickly.
brew "wifi-password"


brew "wget"
brew "jenv"
brew "autojump"
brew "exa"
brew "bat"
brew "fd"
brew "fzf"
brew "m-cli"
brew "mkcert"
brew "the_silver_searcher"
brew "tldr"
brew "transcrypt"
brew "jq"
brew "yq"
brew "aria2"
brew "httpie"

cask "rq"
cask "logitech-presentation"
cask "simplediagrams"
cask "iterm2"
cask "docker"
cask "adoptopenjdk"
cask "iina"
cask "typeit4me"
cask "kap"
cask "google-chrome"
cask "1password"
cask "alfred"
cask "imageoptim"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "paste"
cask "rectangle"
cask "telegram"
cask "visual-studio-code"
cask "grammarly"
cask "slack"
cask "istat-menus"
cask "spotify"
cask "freedom"

mas "DigiDoc4 Client", id: 1370791134
mas "Xcode", id: 497799835
mas "Sip", id: 507257563
mas "Noizio", id: 928871589
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Todoist", id: 585829637
mas "uBlock", id: 1385985095
mas "Grammarly for Safari", id: 1462114288
